In [12]:
import pandas as pd

In [13]:
url = "https://repo.hops.works/master/hopsworks-tutorials/data/card_fraud_data"

In [14]:
credit_cards_df = pd.read_parquet(url + "/credit_cards.parquet")
credit_cards_df.head(5)

             cc_num provider expires
0  4796807885357879     visa   05/23
1  4529266636192966     visa   03/22
2  4922690008243953     visa   02/27
3  4897369589533543     visa   04/22
4  4848518335893425     visa   10/26

In [34]:
credit_cards_df = credit_cards_df[~credit_cards_df.duplicated()]
credit_cards_df.head(5)

             cc_num provider expires
0  4796807885357879     visa   05/23
1  4529266636192966     visa   03/22
2  4922690008243953     visa   02/27
3  4897369589533543     visa   04/22
4  4848518335893425     visa   10/26

In [37]:
credit_cards_df = credit_cards_df.dropna()
credit_cards_df.head(5)

             cc_num provider expires
0  4796807885357879     visa   05/23
1  4529266636192966     visa   03/22
2  4922690008243953     visa   02/27
3  4897369589533543     visa   04/22
4  4848518335893425     visa   10/26

In [15]:
print(credit_cards_df.info())
credit_cards_df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   cc_num    2000 non-null   int64
 1   provider  2000 non-null   object
 2   expires   2000 non-null   object
dtypes: int64(1), object(2)
memory usage: 47.0+ KB
None

             cc_num
count  2.000000e+03
mean   4.496582e+15
std    2.900255e+14
min    4.000323e+15
25%    4.242449e+15
50%    4.501556e+15
75%    4.746010e+15
max    4.999764e+15

In [16]:
credit_cards_df.isna().sum()

cc_num      0
provider    0
expires     0
dtype: int64

In [17]:
len(credit_cards_df[credit_cards_df.duplicated()])

0

In [18]:
trans_df = pd.read_parquet(url + "/transactions.parquet")
trans_df.head(3)

,tid,datetime,cc_num,category,amount,latitude,longitude,city,country,fraud_label
0,11df919988c134d97bbff2678eb68e22,2022-01-01 00:00:24,4473593503484549,Health/Beauty,62.95,42.30865,-83.48216,Canton,US,0
1,dd0b2d6d4266ccd3bf05bc2ea91cf180,2022-01-01 00:00:56,4272465718946864,Grocery,85.45,33.52253,-117.70755,Laguna Niguel,US,0
2,e627f5d9a9739833bd52d2da51761fc3,2022-01-01 00:02:32,4104216579248948,Domestic Transport,21.63,37.60876,-77.37331,Mechanicsville,US,0

In [19]:
trans_df.isna().sum()

tid            0
datetime       0
cc_num         0
category       0
amount         0
latitude       0
longitude      0
city           0
country        0
fraud_label    0
dtype: int64

In [20]:
len(trans_df[trans_df.duplicated()])

0

In [21]:
profiles_df = pd.read_parquet(url + "/profiles.parquet")
profiles_df.head(5)

,name,sex,mail,birthdate,City,Country,cc_num
0,Catherine Zimmerman,F,valenciajason@hotmail.com,1988-09-20,Bryn Mawr-Skyway,US,4796807885357879
1,Michael Williams,M,brettkennedy@yahoo.com,1977-03-01,Gates-North Gates,US,4529266636192966
2,Jessica Krueger,F,marthacruz@hotmail.com,1947-09-10,Greenfield,US,4922690008243953
3,Ruth Harris,F,james11@yahoo.com,1983-12-27,New City,US,4897369589533543
4,Paul Ashley,M,matthew97@hotmail.com,1974-11-10,Peabody,US,4848518335893425

In [22]:
profiles_df.isna().sum()

name         0
sex          0
mail         0
birthdate    0
City         0
Country      0
cc_num       0
dtype: int64

In [23]:
len(profiles_df[profiles_df.duplicated()])

0

In [24]:
trans_df.groupby("cc_num")["amount"].mean().head(5)

cc_num
4000323325541926     50.551364
4001468975474818    412.270000
4001760125154740    417.244810
4002330522123596     38.243182
4002894877268355    183.287532
Name: amount, dtype: float64

In [25]:
trans_df.groupby("cc_num").agg({"amount":["mean", "sum"]})

                      amount
                        mean       sum
cc_num
4000323325541926   50.551364   1112.13
4001468975474818  412.270000   8657.67
4001760125154740  417.244810  32962.34
4002330522123596   38.243182    841.35
4002894877268355  183.287532  14113.14
...                      ...       ...
4997648400548833  532.043077  41499.36
4998520332804015   89.870455   1977.15
4999613767442424  238.403750   5721.69
4999661259770133  403.759767  34723.34
4999763787658689  704.318500  56345.48

[2000 rows x 2 columns]

In [26]:
trans_df.head(5)

,tid,datetime,cc_num,category,amount,latitude,longitude,city,country,fraud_label
0,11df919988c134d97bbff2678eb68e22,2022-01-01 00:00:24,4473593503484549,Health/Beauty,62.95,42.30865,-83.48216,Canton,US,0
1,dd0b2d6d4266ccd3bf05bc2ea91cf180,2022-01-01 00:00:56,4272465718946864,Grocery,85.45,33.52253,-117.70755,Laguna Niguel,US,0
2,e627f5d9a9739833bd52d2da51761fc3,2022-01-01 00:02:32,4104216579248948,Domestic Transport,21.63,37.60876,-77.37331,Mechanicsville,US,0
3,6fb3e6beafbb92b8e15827037f603c52,2022-01-01 00:03:24,4814447237003448,Health/Beauty,54.71,43.54072,-116.56346,Nampa,US,0
4,be0b8acc57bfe126a5a392fd99e6ddd1,2022-01-01 00:03:55,4515188652242507,Grocery,59.22,40.24537,-75.64963,Pottstown,US,0

In [27]:
def rolling_comp(df:pd.DataFrame, window:int):
   return df.rolling(window).agg({"amount":["sum", "mean"],"latitude":"sum"})

In [28]:
rolling_comp(trans_df,3)

          amount                 latitude
             sum         mean         sum
0            NaN          NaN         NaN
1            NaN          NaN         NaN
2         170.03    56.676667  113.439940
3         161.79    53.930000  114.672010
4         135.56    45.186667  121.394850
...          ...          ...         ...
106015  10270.37  3423.456667  125.582735
106016   9892.75  3297.583333  125.588745
106017    414.29   138.096667  125.610018
106018    620.94   206.980000  125.632640
106019    407.27   135.756667  125.651136

[106020 rows x 3 columns]

In [30]:
trans_df.index

RangeIndex(start=0, stop=106020, step=1)

In [38]:
#clean data
def clean_data(df):
    df = df.dropna()
    df = df[~df.duplicated()]
    return df

In [39]:
def data_ingestion():
    url = "https://repo.hops.works/master/hopsworks-tutorials/data/card_fraud_data"
    credit_cards_df = clean_data(pd.read_parquet(url + "/credit_cards.parquet"))
    trans_df = clean_data(pd.read_parquet(url + "/transactions.parquet"))
    profiles_df = clean_data(pd.read_parquet(url + "/profiles.parquet"))